import React from 'react'

// https://open.kakao.com/o/swXx5Qnf

// 1. 자기소개서 작성 

//! 개인 포트폴리오 준비

// 참고할 개인 포트폴리오
// https://hjban-dev.github.io/portfolio/about
// https://giseokkang.github.io/react-portfolio/#/

// https://velog.io/@1876070677/React%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%98%EC%97%AC-%ED%8F%AC%ED%8A%B8%ED%8F%B4%EB%A6%AC%EC%98%A4-%EC%9B%B9%EC%82%AC%EC%9D%B4%ED%8A%B8%EB%A5%BC-%EC%A0%9C%EC%9E%91%ED%95%B4%EB%B3%B4%EC%9E%90

// 2. 개인 블로그 작업('노션', 벨로그, 티스토리)
// - 개인 공부 내용 정리

//^ - 취업 준비를 위한 기술 면접 정리
// Flex와 Grid의 차이점에 대해서 설명해보세요.
// 비동기 함수에 대해서 설명해 보세요.

//^ - 프로그램 환경설정
// VSCODE 사용법 (환경설정, 확장 기능)
// JS/TS 환경설정
// 리액트 환경설정
// Git 사용법

// 3. 개인 프로젝트
// - 수업 시간
//    : 미니 프로젝트 (todoList, ...)
//    : 웹 페이지 프로젝트 (1개 - 온라인서점 프로젝트)
//? - 개인
//?    : '기존의 기능'을 사용하는 웹 페이지 제작
//    : 쇼핑몰(의류, 식품, ...), 회원등록(헬스, 학원, 백화점)
//    : 음식 주문 사이트 (맥도날드, 스타벅스, ...)
//    : 예약, 예매 사이트 (숙박, 운송수단, 여행상품 ...)
//    : 공공기관 사이트

//! 어떤 웹 페이지를 구상
//? 페이지의 종류(페이지 테마) - 2 ~ 3개 리스트

//? 각 페이지의 공통 사항 (ex. 로그인, 회원가입, 마이페이지, 장바구니, 회원 등급)

// 제작할 페이지 구성을 정리(화면 설계서)
// EX) 의류 쇼핑몰
// - 홈 화면 
// (header, nav(남성 의류, 여성 의류, 가방, 지갑 ...), main(), footer)
// - 로그인(아이디, 비밀번호)
// - 회원가입(아이디, 비밀번호, ...)
// - 장바구니
// - 결제
// - 주문내역 확인
// - 문의사항

// 데이터 정리
// 사용자(Users) - 아이디, 비밀번호, 이메일, 이름, 나이, 성별, 집주소, 전화번호 ...
// 제품(Products) - 제품 번호, 제품 이름, 가격, 색상 ...
// 주문(Orders) - 주문 번호, 주문할 제품명, 수량, 총 가격, 배송비 ...
// ..
// ..

export default function Project() {
  return (
    <div></div>
  )
}
